{
    "_class_name": "UNet2DConditionModel",
    "_diffusers_version": "0.2.2",
    "act_fn": "silu",
    "attention_head_dim": 4,
    "block_out_channels": [
      64,
      128,
      512,
      512
    ],
    "center_input_sample": false,
    "cross_attention_dim": 512,
    "down_block_types": [
      "CrossAttnDownBlock2D",
      "CrossAttnDownBlock2D",
      "CrossAttnDownBlock2D",
      "DownBlock2D"
    ],
    "downsample_padding": 1,
    "flip_sin_to_cos": true,
    "freq_shift": 0,
    "in_channels": 1,
    "layers_per_block": 1,
    "mid_block_scale_factor": 1,
    "norm_eps": 1e-05,
    "norm_num_groups": 32,
    "out_channels": 1,
    "sample_size": 64,
    "up_block_types": [
      "UpBlock2D",
      "CrossAttnUpBlock2D",
      "CrossAttnUpBlock2D",
      "CrossAttnUpBlock2D"
    ]
  }